In [1]:
import pandas as pd

titanic_df = pd.read_csv('train.csv')

In [ ]:
titanic_df['Pclass'].head(3) # 단일 열

0    3
1    1
2    3
Name: Pclass, dtype: int64

In [ ]:
titanic_df[['Survived', 'Pclass']].head(3) # 여러 열

   Survived  Pclass
0         0       3
1         1       1
2         1       3

In [ ]:
titanic_df[0:2] # 0~1행

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [ ]:
titanic_df[titanic_df['Pclass'] == 3].head(3) # 조건에 부합하는 행

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [6]:
data = {'Name':['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year':[2011,2016,2015,2015],
        'Gender':['M','F','M','F']}

data_df = pd.DataFrame(data, index=['one','two', 'three', 'four']) # 인덱스 이름 지정
data_df

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three  Jinwoong  2015      M
four    Soobeom  2015      F

In [ ]:
data_df.iloc[0,0] # iloc(행, 열)로 인덱싱 - 숫자로만 입력해야 함, 슬라이싱 가능

'Chulmin'

In [8]:
data_df.iloc[:, -1]

one      M
two      F
three    M
four     F
Name: Gender, dtype: object

In [9]:
data_df.iloc[:, :-1]

           Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

In [10]:
data_df.loc['one', 'Name'] # label 기반으로 indexing - 인덱스 이름, 열 이름으로 접근

'Chulmin'

In [ ]:
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3) # 조건에 부합하는 Name, Age 열 선택

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0